In [8]:
# Pandas fata science library
import pandas as pd
import numpy as np
print(pd.__version__)

2.2.3

In [9]:
# numpy array
arr = np.array([10,20,30,40])
print(arr)
print(type(arr))

[10 20 30 40]
<class 'numpy.ndarray'>

In [6]:
# Pandas series
# A Series is 1d labeled array
# The S in Series must be in capital letter
 
s = pd.Series([10,20,30,40])
print(type(s))
print(s)
print(s.shape)
 
# In Numpy only numbers
#In Series Numbers + Label

<class 'pandas.core.series.Series'>
0    10
1    20
2    30
3    40
dtype: int64
(4,)

In [5]:
# Indexing Slicing and Using Loops
s = pd.Series([10,20,30,40,50,60,70] , index=['val1','val2','val3','val4','val5','val6','val7'])
print(s)

val1    10
val2    20
val3    30
val4    40
val5    50
val6    60
val7    70
dtype: int64

In [ ]:
#using loops 
for

In [11]:
for k,v in s.items():
    print(k,v)

0 10
1 20
2 30
3 40

In [10]:
for i in enumerate(s):
    print(i)

(0, 10)
(1, 20)
(2, 30)
(3, 40)

In [13]:
#pandas DataFrame
# it is used to display the information in atabular fashion
# pandas DataFrame is 2D array

data={'name':['john','Alex','Ali'],
      'dept':['IT','HR','FC'],
      'sal':[2000,4000,5000,],
      'city':['KL','SEL','PERAK']}
print(data)

{'name': ['john', 'Alex', 'Ali'], 'dept': ['IT', 'HR', 'FC'], 'sal': [2000, 4000, 5000], 'city': ['KL', 'SEL', 'PERAK']}

In [14]:
df=pd.DataFrame(data)
print(df)    # if use print function, it show old style

   name dept   sal   city
0  john   IT  2000     KL
1  Alex   HR  4000    SEL
2   Ali   FC  5000  PERAK

In [15]:
df=pd.DataFrame(data)
df     # if not use 'print' it show more stylish table

   name dept   sal   city
0  john   IT  2000     KL
1  Alex   HR  4000    SEL
2   Ali   FC  5000  PERAK

In [16]:
print(df.shape)   # show the shape of data,(row,colomn)

(3, 4)

In [25]:
data= {'calories':[480,600,780],'Duration':[56,34,89]}
df=pd.DataFrame(data,index=['Day 1', 'Day 2', 'Day 3'])
df

       calories  Duration
Day 1       480        56
Day 2       600        34
Day 3       780        89

In [26]:
df['calories']

Day 1    480
Day 2    600
Day 3    780
Name: calories, dtype: int64

In [31]:
df.loc[['Day 2','Day 3']]      # ada dua square bracket ya if nak cari loc lebih dr 1 data

       calories  Duration
Day 2       600        34
Day 3       780        89

In [ ]:
# Using Pandas To Deal With Diff Diff File Formats

      # Read an excel file

      # Read an csv file

      # Read a txt file

      # Read json file

      # Upload Local Files

	  # Read a sql file

In [36]:
# read_exel() used to read on excel
df=pd.read_excel('https://raw.githubusercontent.com/yash240990/Python/master/sampleExcelData.xlsx')
df

,id,first_name,last_name,email,gender,ip_address
0,1,Merle,Draisey,mdraisey0@squarespace.com,Bigender,20.70.199.51
1,2,Casey,Sheach,csheach1@deviantart.com,Male,226.126.229.167
2,3,Darya,Leivers,dleivers2@imgur.com,Female,247.209.88.235
3,4,Fancie,Casebourne,fcasebourne3@g.co,Female,172.34.162.239
4,5,Jenilee,Vsanelli,jvsanelli4@fc2.com,Female,200.104.246.2
...,...,...,...,...,...,...
995,996,Lutero,Yurov,lyurovrn@un.org,Male,95.146.16.187
996,997,Verla,Peery,vpeeryro@com.com,Female,172.90.253.234
997,998,Fran,Langran,flangranrp@ft.com,Male,123.179.99.154
998,999,Gabbi,Cummins,gcumminsrq@jugem.jp,Female,190.13.174.159
999,1000,Gloriane,Marc,gmarcrr@businessweek.com,Female,139.87.192.32

In [40]:
#ExcelFile()
excelfile=pd.ExcelFile('https://raw.githubusercontent.com/yash240990/Python/master/sampleExcelData.xlsx')
excelfile.sheet_names

['data', 'Sheet2']

In [46]:
df=pd.read_excel(excelfile,'Sheet2')
df

   first_name    last_name                                 email
0       Merle      Draisey             mdraisey0@squarespace.com
1       Casey       Sheach               csheach1@deviantart.com
2       Darya      Leivers                   dleivers2@imgur.com
3      Fancie   Casebourne                     fcasebourne3@g.co
4     Jenilee     Vsanelli                    jvsanelli4@fc2.com
5    Charmian    Drinkhall       cdrinkhall5@theglobeandmail.com
6     Janessa       Kivell                 jkivell6@linkedin.com
7       Mirna       Heinsh                  mheinsh7@spotify.com
8       Darby          Lax                   dlax8@people.com.cn
9       Meryl        Riehm                 mriehm9@princeton.edu
10       Anne        Brody                    abrodya@sphinn.com
11       Puff    Langsbury             plangsburyb@canalblog.com
12       Tina      Gregoli                  tgregolic@sfgate.com
13     Barbie       Dahlen                     bdahlend@narod.ru
14     Andeee  Dobrovolski  adobrovolskie@networkadvertising.org
15    Ainsley       Friman                      afrimanf@irs.gov
16        Bil     Shalcros                 bshalcrosg@dion.ne.jp
17    Raimund     Outridge                   routridgeh@lulu.com
18     Whitby     Millward                    wmillwardi@ask.com
19        Rob      Boarder                       rboarderj@51.la
20      Nicky     Curthoys                    ncurthoysk@pbs.org

In [47]:
#read_csv()
#used to read a csv file
df=pd.read_csv('https://raw.githubusercontent.com/yash240990/Python/master/Position_Salaries.csv')
df

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [49]:
#finding the sum of salary using pandas
salaries=df['Salary']
print(type(salaries))

total_sum=salaries.sum()
print(total_sum)

<class 'pandas.core.series.Series'>
2495000

In [50]:
#finding the sum of salary using Numpy
salaries=df['Salary'].to_numpy() #convert to numpy
print(type(salaries))

total_sum=np.sum(salaries)
print(total_sum)

<class 'numpy.ndarray'>
2495000

In [51]:
# read a txt file
df=pd.read_csv('https://raw.githubusercontent.com/yashy1626/ds_dataset/refs/heads/main/iris.txt',sep='\t')   # kalau nak baca .txt file kene ada seperator klu x unreadable data
df

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [52]:
#read_json()
#used to read json file format
df=pd.read_json('https://raw.githubusercontent.com/yash240990/Python/master/simple.json')
df

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [55]:
df=pd.read_csv('T-shirt company.csv')
df

,id,first_name,email,gender,department,T-shirt size,city,country
0,1,Hillel,hmaclaig0@pen.io,Male,Training,L,Songzhuang,China
1,2,Sibbie,speasegod1@drupal.org,Female,Business Development,L,Boyu,China
2,3,Bone,bgratland2@si.edu,Male,Support,3XL,Liucheng,China
3,4,Opaline,olefridge3@yahoo.co.jp,Agender,Sales,XS,Hulu,China
4,5,Alice,acurston4@wisc.edu,Female,Research and Development,S,Dongkeng,China
...,...,...,...,...,...,...,...,...
995,996,Chaim,cwoodingsrn@shutterfly.com,Male,Human Resources,XL,Huangnan,China
996,997,Lyell,lstclairro@printfriendly.com,Male,Accounting,XL,Wu’erbu Baolige,China
997,998,Teddie,teddisforthrp@soup.io,Male,Marketing,3XL,Leidian,China
998,999,Elka,ekingcoterq@artisteer.com,Female,Business Development,XL,Yeping,China
999,1000,Ambur,ascrynerr@goodreads.com,Female,Human Resources,L,Bijia,China